###::::::::::'###::::'########:::::'###::::::::::::::'#######::
 ##:::::::::'## ##::: ##.... ##:::'## ##::::::::::::'##.... ##:
 ##::::::::'##:. ##:: ##:::: ##::'##:. ##:::::::::::..::::: ##:
 ##:::::::'##:::. ##: ########::'##:::. ##:'#######::'#######::
 ##::::::: #########: ##.... ##: #########:........::...... ##:
 ##::::::: ##.... ##: ##:::: ##: ##.... ##::::::::::'##:::: ##:
 ########: ##:::: ##: ########:: ##:::: ##::::::::::. #######::
#........::..:::::..::........:::..:::::..::::::::::::.......:::
#3.4
def four():
    print("У вас есть 3 попытки чтобы правильно ответить")
    import random
    correct=0
    mistaces=0
    while mistaces < 3:
        a=random.randrange(1,100)
        b=random.randrange(1,100)
        answer= a + b
        otvet=('не правильно, првильный ответ =',answer)
        hi=input(f"{a} + {b} = ")
        if int(hi) == answer:
           correct += 1
           print('правильно!')
        else:
           mistaces += 1
           print('Не правильно! Правильный ответ -',answer)
    print(f'Игра окончена! Правильных ответов -', correct,'не правильных ответов -', mistaces)
#3.1
def one():
    noe_chislo=input("Введите предлоэение - ")
    print(noe_chislo.replace(' ',''))
    print(
        ' '.join([input("Введите слово - ") for i in range(int(input('Введите количество слов - ')))])
          )
#3.2
def trhee():
    print('Введите слова, чтобы закончить ввод слов напишите "stop"')
    while True:
        word = input('Введите слово - ')
        if word == "stop":
            print('Вы остановили процесс')
            break
        print(" ".join(word))
#3.3
def second():
    print('Чтобы закончить ввод слов напишите "stop"')
    while True:
        rare_words = str(input('Введите слово - '))
        if "ф" in rare_words.lower():
            print('Ого! Это редкое слово!')
        else:
          print('Эх, это не очень редкое слово')
        if rare_words=="stop":
            break
    print('Вы закончили ввод слов')
#first,second,three,four
